### Criando ambiente

```sh
# Alterar as variáveis "CAMINHO_COMPLETO_PASTA_DATA" e "CAMINHO_COMPLETO_PASTA_IMPORT", pelo caminho completo da pastas data e import relativos ao diretório atual.
docker run --publish=7474:7474 --publish=7687:7687 --volume=<CAMINHO_COMPLETO_PASTA_DATA>:/data --volume=<CAMINHO_COMPLETO_PASTA_IMPORT>:/import neo4j:3.5.5
# Ex:
docker run --publish=7474:7474 --publish=7687:7687 --volume=C:/tmp/fiap/arquitetura-dados/neo4j/data:/data --volume=C:/tmp/fiap/arquitetura-dados/neo4j/import:/import neo4j:3.5.5
```

Acessar [http://localhost:7474/browser/](http://localhost:7474/browser/).

### Modelo

![](modelo.png?raw=true)

### Importando os dados


```sh
MATCH(n) DETACH DELETE n
```


```sh
USING PERIODIC COMMIT 500
LOAD CSV WITH HEADERS FROM 'file:///matches.csv' AS line

MERGE (c:CopaDoMundo {nome: line.world_cup})-[:REALIZADA_EM]->(a:Ano {ano:toInteger(line.year)})
MERGE (p:Partida {id: line.id, placar_time_casa: toInteger(line.h_score), placar_time_visitante: toInteger(line.a_score), publico: line.attendance, data:line.date})
MERGE (e:Estadio {nome: line.stadium})
MERGE (f:Fase {nome: line.phase})
MERGE (time_casa:Pais {nome: line.home})
MERGE (time_visitante:Pais {nome: line.away})
MERGE (c)-[:COMPOSTA_POR]->(p)
MERGE (p)-[:DISPUTADA_NO]->(e)
MERGE (p)-[:NA_FASE]->(f)
MERGE (p)-[:TIME_DA_CASA]->(time_casa)
MERGE (p)-[:TIME_VISITANTE]->(time_visitante)
MERGE (c)-[:ORGANIZADA_POR]->(pais_realizador)
MERGE (time_casa)-[:JOGOU_EM]->(p)
MERGE (time_visitante)-[:JOGOU_EM]->(p)

MATCH (c:CopaDoMundo)-[rel:COMPOSTA_POR]->(p:Partida) RETURN c, rel, p
```

```sh
USING PERIODIC COMMIT 500
LOAD CSV WITH HEADERS FROM 'file:///squads.csv' AS line

MATCH (c:CopaDoMundo)-[rel:REALIZADA_EM]->(a:Ano {ano: toInteger(line.year)})

MERGE (j:Jogador{id: line.player_id, nome: line.player_name})
MERGE (s:Selecao{nome: line.country, ano: toInteger(line.year)})
MERGE (p:Pais{nome: line.country})
MERGE (p)-[:CONVOCOU]->(s)
MERGE (j)-[:JOGOU_POR]->(s)
MERGE (s)-[:PARA_A_COPA]->(c)

MATCH (s:Selecao)-[rel:PARA_A_COPA]->(c:CopaDoMundo) RETURN s, rel, c
```

```sh
USING PERIODIC COMMIT 500
LOAD CSV WITH HEADERS FROM 'file:///lineups.csv' AS line
MATCH (j:Jogador {id: line.player_id})
MATCH (p:Partida {id: line.match_id})

FOREACH (gol in CASE WHEN line.type IN ['starting'] THEN [1] ELSE [] END | 
   MERGE (e:Estatistica)-[:NA_PARTIDA]->(p)
   MERGE (j)-[:TITULAR]->(e)
)

FOREACH (gol in CASE WHEN line.type IN ['sub'] THEN [1] ELSE [] END | 
   MERGE (e:Estatistica)-[:NA_PARTIDA]->(p)
   MERGE (j)-[:RESERVA]->(e)
)

MATCH (e:Estatistica)-[rel:NA_PARTIDA]->(p:Partida) RETURN e, rel, p
```

```sh
USING PERIODIC COMMIT 500
LOAD CSV WITH HEADERS FROM 'file:///events.csv' AS line
MATCH (j:Jogador {id: line.player_id})
MATCH (p:Partida {id: line.match_id})
MATCH (e:Estatistica)<-[:TITULAR|:RESERVA]-(j)

FOREACH (gol in CASE WHEN line.type IN ['penalty', 'goal', 'owngoal'] THEN [1] ELSE [] END | 
   MERGE (g:Gol{tipo: line.type, tempo: toInteger(line.time)})<-[:MARCOU_UM_GOL]-(e)
)

FOREACH (cartao in CASE WHEN line.type IN ['red', 'yellow'] THEN [1] ELSE [] END | 
   MERGE (c:Cartao{tipo: line.type, tempo: toInteger(line.time)})<-[:RECEBEU_CARTAO]-(e)
)

MATCH (e:Estatistica)-[rel:MARCOU_UM_GOL]->(g:Gol) RETURN e, rel, g
MATCH (e:Estatistica)-[rel:RECEBEU_CARTAO]->(c:Cartao) RETURN e, rel, c
```

### Questões:

1. Estádios com mais gols

```sh
MATCH (e:Estadio)<-[:DISPUTADA_NO]-(p:Partida) RETURN e.nome AS nome_estadio, SUM(p.placar_time_casa) + SUM(p.placar_time_visitante) AS gols_no_estadio ORDER BY gols_no_estadio DESC LIMIT(10)
```

```
╒══════════════════════════════════════════════════════════════╤═════════════════╕
│"nome_estadio"                                                │"gols_no_estadio"│
╞══════════════════════════════════════════════════════════════╪═════════════════╡
│"Mexico City  / Estadio Azteca"                               │52               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Basel  / St. Jakob"                                          │44               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Montevideo  / Centenario"                                    │44               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Leon  / Nou Camp - Estadio León"                             │42               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Guadalajara  / Jalisco"                                      │39               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Paris  / Parc des Princes"                                   │32               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Cordoba  / Estadio Olímpico Chateau Carreras"                │32               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Rio De Janeiro  / 'Maracanã - Estádio Jornalista Mário Filho"│29               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Arica  / Carlos Dittborn"                                    │28               │
├──────────────────────────────────────────────────────────────┼─────────────────┤
│"Zurich  / Hardturm"                                          │28               │
└──────────────────────────────────────────────────────────────┴─────────────────┘
```

2. Jogadores que participaram em mais do que uma copa
```sh
MATCH (j:Jogador)-[:JOGOU_POR]->(s:Selecao)-[:PARA_A_COPA]->(c:CopaDoMundo)
WITH j AS j, COUNT(c) AS contagem_copas
WHERE contagem_copas > 1
RETURN j.nome AS nome_jogador, contagem_copas ORDER BY contagem_copas DESC
```

```
╒══════════════════════════╤════════════════╕
│"nome_jogador"            │"contagem_copas"│
╞══════════════════════════╪════════════════╡
│"Lothar Matthaeus"        │5               │
├──────────────────────────┼────────────────┤
│"Antonio Carbajal"        │5               │
├──────────────────────────┼────────────────┤
│"Gianluigi Buffon"        │4               │
├──────────────────────────┼────────────────┤
│"Fabio Cannavaro"         │4               │
├──────────────────────────┼────────────────┤
│"Lee Woon Jae"            │4               │
├──────────────────────────┼────────────────┤
│"Rigobert Song"           │4               │
├──────────────────────────┼────────────────┤
│"Yoshikatsu Kawaguchi"    │4               │
├──────────────────────────┼────────────────┤
│"Seigo Narazaki"          │4               │
├──────────────────────────┼────────────────┤
│"Thierry Henry"           │4               │
├──────────────────────────┼────────────────┤
│"Denis Caniza"            │4               │
├──────────────────────────┼────────────────┤
│"Kasey Keller"            │4               │
├──────────────────────────┼────────────────┤
│"Claudio Reyna"           │4               │
├──────────────────────────┼────────────────┤
│"Mohammed Al Deayea"      │4               │
├──────────────────────────┼────────────────┤
│"Sami Al Jaber"           │4               │
├──────────────────────────┼────────────────┤
│"Oliver Kahn"             │4               │
├──────────────────────────┼────────────────┤
│"Cafu"                    │4               │
├──────────────────────────┼────────────────┤
│"Ronaldo"                 │4               │
├──────────────────────────┼────────────────┤
│"Fernando Hierro"         │4               │
├──────────────────────────┼────────────────┤
│"Paolo Maldini"           │4               │
├──────────────────────────┼────────────────┤
│"Jacques Songoo"          │4               │
├──────────────────────────┼────────────────┤
│"Hwang Sun Hong"          │4               │
├──────────────────────────┼────────────────┤
│"Hong Myung Bo"           │4               │
├──────────────────────────┼────────────────┤
│"Marc Wilmots"            │4               │
├──────────────────────────┼────────────────┤
│"Jim Leighton"            │4               │
├──────────────────────────┼────────────────┤
│"Andoni Zubizarreta"      │4               │
├──────────────────────────┼────────────────┤
│"Giuseppe Bergomi"        │4               │
├──────────────────────────┼────────────────┤
│"Franky Van Der Elst"     │4               │
├──────────────────────────┼────────────────┤
│"Enzo Scifo"              │4               │
├──────────────────────────┼────────────────┤
│"Diego Maradona"          │4               │
├──────────────────────────┼────────────────┤
│"Wladyslaw Zmuda"         │4               │
├──────────────────────────┼────────────────┤
│"Leao"                    │4               │
├──────────────────────────┼────────────────┤
│"Dino Zoff"               │4               │
├──────────────────────────┼────────────────┤
│"Sepp Maier"              │4               │
├──────────────────────────┼────────────────┤
│"Gianni Rivera"           │4               │
├──────────────────────────┼────────────────┤
│"Enrico Albertosi"        │4               │
├──────────────────────────┼────────────────┤
│"Pedro Rocha"             │4               │
├──────────────────────────┼────────────────┤
│"Pelé"                    │4               │
├──────────────────────────┼────────────────┤
│"Uwe Seeler"              │4               │
├──────────────────────────┼────────────────┤
│"Karl-heinz Schnellinger" │4               │
├──────────────────────────┼────────────────┤
│"Lev Yashin"              │4               │
├──────────────────────────┼────────────────┤
│"Bobby Charlton"          │4               │
├──────────────────────────┼────────────────┤
│"Djalma Santos"           │4               │
├──────────────────────────┼────────────────┤
│"Castilho"                │4               │
├──────────────────────────┼────────────────┤
│"Nilton Santos"           │4               │
├──────────────────────────┼────────────────┤
│"Steve Cherundolo"        │3               │
├──────────────────────────┼────────────────┤
│"Damarcus Beasley"        │3               │
├──────────────────────────┼────────────────┤
│"Landon Donovan"          │3               │
├──────────────────────────┼────────────────┤
│"Carles Puyol"            │3               │
├──────────────────────────┼────────────────┤
│"Iker Casillas"           │3               │
├──────────────────────────┼────────────────┤
│"Xavi"                    │3               │
├──────────────────────────┼────────────────┤
│"Dejan Stankovic"         │3               │
├──────────────────────────┼────────────────┤
│"Gianluca Zambrotta"      │3               │
├──────────────────────────┼────────────────┤
│"Gennaro Gattuso"         │3               │
├──────────────────────────┼────────────────┤
│"Miroslav Klose"          │3               │
├──────────────────────────┼────────────────┤
│"Gerardo Torrado"         │3               │
├──────────────────────────┼────────────────┤
│"Oscar Perez"             │3               │
├──────────────────────────┼────────────────┤
│"Rafael Marquez"          │3               │
├──────────────────────────┼────────────────┤
│"Cuauhtemoc Blanco"       │3               │
├──────────────────────────┼────────────────┤
│"Lee Young Pyo"           │3               │
├──────────────────────────┼────────────────┤
│"Ahn Jung Hwan"           │3               │
├──────────────────────────┼────────────────┤
│"Park Ji Sung"            │3               │
├──────────────────────────┼────────────────┤
│"Kim Nam Il"              │3               │
├──────────────────────────┼────────────────┤
│"Samuel Etoo"             │3               │
├──────────────────────────┼────────────────┤
│"Ashley Cole"             │3               │
├──────────────────────────┼────────────────┤
│"David James"             │3               │
├──────────────────────────┼────────────────┤
│"Joe Cole"                │3               │
├──────────────────────────┼────────────────┤
│"Martin Jorgensen"        │3               │
├──────────────────────────┼────────────────┤
│"Giovanni Van Bronckhorst"│3               │
├──────────────────────────┼────────────────┤
│"Andre Ooijer"            │3               │
├──────────────────────────┼────────────────┤
│"Junichi Inamoto"         │3               │
├──────────────────────────┼────────────────┤
│"Roque Santa Cruz"        │3               │
├──────────────────────────┼────────────────┤
│"Julio Cesar Caceres"     │3               │
├──────────────────────────┼────────────────┤
│"Justo Villar"            │3               │
├──────────────────────────┼────────────────┤
│"Carlos Bonet"            │3               │
├──────────────────────────┼────────────────┤
│"Nwankwo Kanu"            │3               │
├──────────────────────────┼────────────────┤
│"Gilberto Silva"          │3               │
├──────────────────────────┼────────────────┤
│"Lucio"                   │3               │
├──────────────────────────┼────────────────┤
│"Kaka"                    │3               │
├──────────────────────────┼────────────────┤
│"Juan Veron"              │3               │
├──────────────────────────┼────────────────┤
│"Teddy Lucic"             │3               │
├──────────────────────────┼────────────────┤
│"Henrik Larsson"          │3               │
├──────────────────────────┼────────────────┤
│"Filippo Inzaghi"         │3               │
├──────────────────────────┼────────────────┤
│"Alessandro Del Piero"    │3               │
├──────────────────────────┼────────────────┤
│"Alessandro Nesta"        │3               │
├──────────────────────────┼────────────────┤
│"Brian Mcbride"           │3               │
├──────────────────────────┼────────────────┤
│"Eddie Pope"              │3               │
├──────────────────────────┼────────────────┤
│"Hidetoshi Nakata"        │3               │
├──────────────────────────┼────────────────┤
│"Shinji Ono"              │3               │
├──────────────────────────┼────────────────┤
│"Oswaldo Sanchez"         │3               │
├──────────────────────────┼────────────────┤
│"Claudio Suarez"          │3               │
├──────────────────────────┼────────────────┤
│"Jesus Arellano"          │3               │
├──────────────────────────┼────────────────┤
│"Ali Boumnijel"           │3               │
├──────────────────────────┼────────────────┤
│"Kais Ghodhbane"          │3               │
├──────────────────────────┼────────────────┤
│"Hatem Trabelsi"          │3               │
├──────────────────────────┼────────────────┤
│"Riadh Bouazizi"          │3               │
├──────────────────────────┼────────────────┤
│"Santiago Canizares"      │3               │
├──────────────────────────┼────────────────┤
│"Raul"                    │3               │
├──────────────────────────┼────────────────┤
│"Edwin Van Der Sar"       │3               │
├──────────────────────────┼────────────────┤
│"Nawaf Al Temiyat"        │3               │
├──────────────────────────┼────────────────┤
│"Hussein Al Sulaimani"    │3               │
├──────────────────────────┼────────────────┤
│"Ahmed Al Dosari"         │3               │
├──────────────────────────┼────────────────┤
│"Roberto Acuna"           │3               │
├──────────────────────────┼────────────────┤
│"Carlos Paredes"          │3               │
├──────────────────────────┼────────────────┤
│"Carlos Gamarra"          │3               │
├──────────────────────────┼────────────────┤
│"Jens Lehmann"            │3               │
├──────────────────────────┼────────────────┤
│"Rio Ferdinand"           │3               │
├──────────────────────────┼────────────────┤
│"Sol Campbell"            │3               │
├──────────────────────────┼────────────────┤
│"Michael Owen"            │3               │
├──────────────────────────┼────────────────┤
│"David Beckham"           │3               │
├──────────────────────────┼────────────────┤
│"Fabien Barthez"          │3               │
├──────────────────────────┼────────────────┤
│"Zinedine Zidane"         │3               │
├──────────────────────────┼────────────────┤
│"Lilian Thuram"           │3               │
├──────────────────────────┼────────────────┤
│"David Trezeguet"         │3               │
├──────────────────────────┼────────────────┤
│"Patrick Vieira"          │3               │
├──────────────────────────┼────────────────┤
│"Dida"                    │3               │
├──────────────────────────┼────────────────┤
│"Roberto Carlos"          │3               │
├──────────────────────────┼────────────────┤
│"Anthony Seric"           │3               │
├──────────────────────────┼────────────────┤
│"Dario Simic"             │3               │
├──────────────────────────┼────────────────┤
│"Roberto Ayala"           │3               │
├──────────────────────────┼────────────────┤
│"Hernan Crespo"           │3               │
├──────────────────────────┼────────────────┤
│"Tony Meola"              │3               │
├──────────────────────────┼────────────────┤
│"Earnie Stewart"          │3               │
├──────────────────────────┼────────────────┤
│"Joe Max Moore"           │3               │
├──────────────────────────┼────────────────┤
│"Cobi Jones"              │3               │
├──────────────────────────┼────────────────┤
│"Brad Friedel"            │3               │
├──────────────────────────┼────────────────┤
│"Luis Enrique"            │3               │
├──────────────────────────┼────────────────┤
│"Miguel Angel Nadal"      │3               │
├──────────────────────────┼────────────────┤
│"Mutiu Adepoju"           │3               │
├──────────────────────────┼────────────────┤
│"Jay Jay Okocha"          │3               │
├──────────────────────────┼────────────────┤
│"Steve Staunton"          │3               │
├──────────────────────────┼────────────────┤
│"Jorge Campos"            │3               │
├──────────────────────────┼────────────────┤
│"Alberto Garcia Aspe"     │3               │
├──────────────────────────┼────────────────┤
│"Abdullah Zubromawi"      │3               │
├──────────────────────────┼────────────────┤
│"Davor Suker"             │3               │
├──────────────────────────┼────────────────┤
│"Robert Prosinecki"       │3               │
├──────────────────────────┼────────────────┤
│"Robert Jarni"            │3               │
├──────────────────────────┼────────────────┤
│"Raymond Kalla"           │3               │
├──────────────────────────┼────────────────┤
│"David Seaman"            │3               │
├──────────────────────────┼────────────────┤
│"Eric Van Meir"           │3               │
├──────────────────────────┼────────────────┤
│"Danny Boffin"            │3               │
├──────────────────────────┼────────────────┤
│"Gabriel Batistuta"       │3               │
├──────────────────────────┼────────────────┤
│"Diego Simeone"           │3               │
├──────────────────────────┼────────────────┤
│"Claudio Caniggia"        │3               │
├──────────────────────────┼────────────────┤
│"Jose Chamot"             │3               │
├──────────────────────────┼────────────────┤
│"Ariel Ortega"            │3               │
├──────────────────────────┼────────────────┤
│"Aron Winter"             │3               │
├──────────────────────────┼────────────────┤
│"Ilie Dumitrescu"         │3               │
├──────────────────────────┼────────────────┤
│"Gheorghe Popescu"        │3               │
├──────────────────────────┼────────────────┤
│"Bogdan Stelea"           │3               │
├──────────────────────────┼────────────────┤
│"Gheorghe Hagi"           │3               │
├──────────────────────────┼────────────────┤
│"Rafael Alkorta"          │3               │
├──────────────────────────┼────────────────┤
│"Gianluca Pagliuca"       │3               │
├──────────────────────────┼────────────────┤
│"Roberto Baggio"          │3               │
├──────────────────────────┼────────────────┤
│"Tab Ramos"               │3               │
├──────────────────────────┼────────────────┤
│"Eric Wynalda"            │3               │
├──────────────────────────┼────────────────┤
│"Marcelo Balboa"          │3               │
├──────────────────────────┼────────────────┤
│"Abel Balbo"              │3               │
├──────────────────────────┼────────────────┤
│"Roberto Sensini"         │3               │
├──────────────────────────┼────────────────┤
│"Olaf Thon"               │3               │
├──────────────────────────┼────────────────┤
│"Andreas Moeller"         │3               │
├──────────────────────────┼────────────────┤
│"Thomas Haessler"         │3               │
├──────────────────────────┼────────────────┤
│"Juergen Klinsmann"       │3               │
├──────────────────────────┼────────────────┤
│"Andreas Koepke"          │3               │
├──────────────────────────┼────────────────┤
│"Juergen Kohler"          │3               │
├──────────────────────────┼────────────────┤
│"Borislav Mihaylov"       │3               │
├──────────────────────────┼────────────────┤
│"Borislav Mikhailov"      │3               │
├──────────────────────────┼────────────────┤
│"Francois Omam-biyik"     │3               │
├──────────────────────────┼────────────────┤
│"Filip De Wilde"          │3               │
├──────────────────────────┼────────────────┤
│"Lorenzo Staelens"        │3               │
├──────────────────────────┼────────────────┤
│"Carlos Valderrama"       │3               │
├──────────────────────────┼────────────────┤
│"Freddy Rincon"           │3               │
├──────────────────────────┼────────────────┤
│"Bebeto"                  │3               │
├──────────────────────────┼────────────────┤
│"Taffarel"                │3               │
├──────────────────────────┼────────────────┤
│"Aldair"                  │3               │
├──────────────────────────┼────────────────┤
│"Dunga"                   │3               │
├──────────────────────────┼────────────────┤
│"Julio Salinas"           │3               │
├──────────────────────────┼────────────────┤
│"Kim Joo Sung"            │3               │
├──────────────────────────┼────────────────┤
│"Hugo Sánchez"            │3               │
├──────────────────────────┼────────────────┤
│"Michel De Wolf"          │3               │
├──────────────────────────┼────────────────┤
│"Georges Grun"            │3               │
├──────────────────────────┼────────────────┤
│"Branco"                  │3               │
├──────────────────────────┼────────────────┤
│"Muller"                  │3               │
├──────────────────────────┼────────────────┤
│"Oscar Ruggeri"           │3               │
├──────────────────────────┼────────────────┤
│"Rudi Voeller"            │3               │
├──────────────────────────┼────────────────┤
│"Thomas Berthold"         │3               │
├──────────────────────────┼────────────────┤
│"Andreas Brehme"          │3               │
├──────────────────────────┼────────────────┤
│"Roger Milla"             │3               │
├──────────────────────────┼────────────────┤
│"Thomas Nkono"            │3               │
├──────────────────────────┼────────────────┤
│"Joseph Antoine Bell"     │3               │
├──────────────────────────┼────────────────┤
│"Franco Baresi"           │3               │
├──────────────────────────┼────────────────┤
│"Rinat Dasaev"            │3               │
├──────────────────────────┼────────────────┤
│"Vladimir Bessonov"       │3               │
├──────────────────────────┼────────────────┤
│"Anatoli Demyanenko"      │3               │
├──────────────────────────┼────────────────┤
│"Alex Mcleish"            │3               │
├──────────────────────────┼────────────────┤
│"Pierre Littbarski"       │3               │
├──────────────────────────┼────────────────┤
│"Pietro Vierchowod"       │3               │
├──────────────────────────┼────────────────┤
│"Carlo Ancelotti"         │3               │
├──────────────────────────┼────────────────┤
│"Jan Ceulemans"           │3               │
├──────────────────────────┼────────────────┤
│"Eric Gerets"             │3               │
├──────────────────────────┼────────────────┤
│"Terry Butcher"           │3               │
├──────────────────────────┼────────────────┤
│"Bryan Robson"            │3               │
├──────────────────────────┼────────────────┤
│"Peter Shilton"           │3               │
├──────────────────────────┼────────────────┤
│"Julio Olarticoechea"     │3               │
├──────────────────────────┼────────────────┤
│"Nery Pumpido"            │3               │
├──────────────────────────┼────────────────┤
│"Zbigniew Boniek"         │3               │
├──────────────────────────┼────────────────┤
│"Roman Wojcicki"          │3               │
├──────────────────────────┼────────────────┤
│"Graeme Souness"          │3               │
├──────────────────────────┼────────────────┤
│"Alan Rough"              │3               │
├──────────────────────────┼────────────────┤
│"Francisco Urruticoechea" │3               │
├──────────────────────────┼────────────────┤
│"Antonio Cabrini"         │3               │
├──────────────────────────┼────────────────┤
│"Gaetano Scirea"          │3               │
├──────────────────────────┼────────────────┤
│"Marco Tardelli"          │3               │
├──────────────────────────┼────────────────┤
│"Paolo Rossi"             │3               │
├──────────────────────────┼────────────────┤
│"Karl-heinz Rummenigge"   │3               │
├──────────────────────────┼────────────────┤
│"Carlos"                  │3               │
├──────────────────────────┼────────────────┤
│"Oscar"                   │3               │
├──────────────────────────┼────────────────┤
│"Edinho"                  │3               │
├──────────────────────────┼────────────────┤
│"Zico"                    │3               │
├──────────────────────────┼────────────────┤
│"Daniel Passarella"       │3               │
├──────────────────────────┼────────────────┤
│"Patrick Battiston"       │3               │
├──────────────────────────┼────────────────┤
│"Michel Platini"          │3               │
├──────────────────────────┼────────────────┤
│"Dominique Rocheteau"     │3               │
├──────────────────────────┼────────────────┤
│"Maxime Bossis"           │3               │
├──────────────────────────┼────────────────┤
│"Grzegorz Lato"           │3               │
├──────────────────────────┼────────────────┤
│"Marek Kusto"             │3               │
├──────────────────────────┼────────────────┤
│"Andrzej Szarmach"        │3               │
├──────────────────────────┼────────────────┤
│"Teofilo Cubillas"        │3               │
├──────────────────────────┼────────────────┤
│"Joe Jordan"              │3               │
├──────────────────────────┼────────────────┤
│"Kenny Dalglish"          │3               │
├──────────────────────────┼────────────────┤
│"Dirceu"                  │3               │
├──────────────────────────┼────────────────┤
│"Mario Kempes"            │3               │
├──────────────────────────┼────────────────┤
│"Ubaldo Fillol"           │3               │
├──────────────────────────┼────────────────┤
│"Franco Causio"           │3               │
├──────────────────────────┼────────────────┤
│"Elias Figueroa"          │3               │
├──────────────────────────┼────────────────┤
│"Bjorn Nordqvist"         │3               │
├──────────────────────────┼────────────────┤
│"Bo Larsson"              │3               │
├──────────────────────────┼────────────────┤
│"Ronnie Hellstrom"        │3               │
├──────────────────────────┼────────────────┤
│"Berti Vogts"             │3               │
├──────────────────────────┼────────────────┤
│"Rivelino"                │3               │
├──────────────────────────┼────────────────┤
│"Franz Beckenbauer"       │3               │
├──────────────────────────┼────────────────┤
│"Juergen Grabowski"       │3               │
├──────────────────────────┼────────────────┤
│"Horst-dieter Hoettges"   │3               │
├──────────────────────────┼────────────────┤
│"Wolfgang Overath"        │3               │
├──────────────────────────┼────────────────┤
│"Edu"                     │3               │
├──────────────────────────┼────────────────┤
│"Jairzinho"               │3               │
├──────────────────────────┼────────────────┤
│"Simeon Simeonov"         │3               │
├──────────────────────────┼────────────────┤
│"Dimitar Penev"           │3               │
├──────────────────────────┼────────────────┤
│"Giacinto Facchetti"      │3               │
├──────────────────────────┼────────────────┤
│"Sandro Mazzola"          │3               │
├──────────────────────────┼────────────────┤
│"Tarcisio Burgnich"       │3               │
├──────────────────────────┼────────────────┤
│"Antonio Juliano"         │3               │
├──────────────────────────┼────────────────┤
│"Ladislao Mazurkiewicz"   │3               │
├──────────────────────────┼────────────────┤
│"Victor Esparrago"        │3               │
├──────────────────────────┼────────────────┤
│"Luis Cubilla"            │3               │
├──────────────────────────┼────────────────┤
│"Isidoro Diaz"            │3               │
├──────────────────────────┼────────────────┤
│"Julio Cortes"            │3               │
├──────────────────────────┼────────────────┤
│"Dimitar Yakimov"         │3               │
├──────────────────────────┼────────────────┤
│"Georgi Asparukhov"       │3               │
├──────────────────────────┼────────────────┤
│"Dinko Dermendzhiev"      │3               │
├──────────────────────────┼────────────────┤
│"Helmut Haller"           │3               │
├──────────────────────────┼────────────────┤
│"Willi Schulz"            │3               │
├──────────────────────────┼────────────────┤
│"Albert Shesternyov"      │3               │
├──────────────────────────┼────────────────┤
│"Slava Metreveli"         │3               │
├──────────────────────────┼────────────────┤
│"Viktor Serebryanikov"    │3               │
├──────────────────────────┼────────────────┤
│"Bobby Moore"             │3               │
├──────────────────────────┼────────────────┤
│"Gordon Banks"            │3               │
├──────────────────────────┼────────────────┤
│"Ferenc Sipos"            │3               │
├──────────────────────────┼────────────────┤
│"Sandor Matrai"           │3               │
├──────────────────────────┼────────────────┤
│"Lajos Tichy"             │3               │
├──────────────────────────┼────────────────┤
│"Mate Fenyvesi"           │3               │
├──────────────────────────┼────────────────┤
│"Gilmar"                  │3               │
├──────────────────────────┼────────────────┤
│"Zito"                    │3               │
├──────────────────────────┼────────────────┤
│"Garrincha"               │3               │
├──────────────────────────┼────────────────┤
│"Bellini"                 │3               │
├──────────────────────────┼────────────────┤
│"Jesus Del Muro"          │3               │
├──────────────────────────┼────────────────┤
│"Salvador Reyes"          │3               │
├──────────────────────────┼────────────────┤
│"Leonid Ostrovski"        │3               │
├──────────────────────────┼────────────────┤
│"Gyula Grosics"           │3               │
├──────────────────────────┼────────────────┤
│"Kiki Antenen"            │3               │
├──────────────────────────┼────────────────┤
│"William Martinez"        │3               │
├──────────────────────────┼────────────────┤
│"Hans Schaefer"           │3               │
├──────────────────────────┼────────────────┤
│"Herbert Erhardt"         │3               │
├──────────────────────────┼────────────────┤
│"Raul Cardenas"           │3               │
├──────────────────────────┼────────────────┤
│"Viliam Schrojf"          │3               │
├──────────────────────────┼────────────────┤
│"Svatopluk Pluskal"       │3               │
├──────────────────────────┼────────────────┤
│"Ladislav Novak"          │3               │
├──────────────────────────┼────────────────┤
│"John Haynes"             │3               │
├──────────────────────────┼────────────────┤
│"Mauro Ramos"             │3               │
├──────────────────────────┼────────────────┤
│"Didi"                    │3               │
├──────────────────────────┼────────────────┤
│"Jose Roca"               │3               │
├──────────────────────────┼────────────────┤
│"Vladimir Beara"          │3               │
├──────────────────────────┼────────────────┤
│"Billy Wright"            │3               │
├──────────────────────────┼────────────────┤
│"Tom Finney"              │3               │
├──────────────────────────┼────────────────┤
│"Nicolae Kovacs"          │3               │
├──────────────────────────┼────────────────┤
│"Arnold Badjou"           │3               │
├──────────────────────────┼────────────────┤
│"Bernard Voorhoof"        │3               │
├──────────────────────────┼────────────────┤
│"Emile Veinante"          │3               │
├──────────────────────────┼────────────────┤
│"Edmond Delfour"          │3               │
├──────────────────────────┼────────────────┤
│"Etienne Mattler"         │3               │
├──────────────────────────┼────────────────┤
│"Clint Dempsey"           │2               │
├──────────────────────────┼────────────────┤
│"Carlos Bocanegra"        │2               │
├──────────────────────────┼────────────────┤
│"Tim Howard"              │2               │
├──────────────────────────┼────────────────┤
│"Marcus Hahnemann"        │2               │
├──────────────────────────┼────────────────┤
│"Oguchi Onyewu"           │2               │
├──────────────────────────┼────────────────┤
│"Diego Forlan"            │2               │
├──────────────────────────┼────────────────┤
│"Sebastian Abreu"         │2               │
├──────────────────────────┼────────────────┤
│"Tranquillo Barnetta"     │2               │
├──────────────────────────┼────────────────┤
│"Stephane Grichting"      │2               │
├──────────────────────────┼────────────────┤
│"Valon Behrami"           │2               │
├──────────────────────────┼────────────────┤
│"Diego Benaglio"          │2               │
├──────────────────────────┼────────────────┤
│"Hakan Yakin"             │2               │
├──────────────────────────┼────────────────┤
│"Ludovic Magnin"          │2               │
├──────────────────────────┼────────────────┤
│"Philippe Senderos"       │2               │
├──────────────────────────┼────────────────┤
│"Alexander Frei"          │2               │
├──────────────────────────┼────────────────┤
│"Iniesta"                 │2               │
├──────────────────────────┼────────────────┤
│"Cesc"                    │2               │
├──────────────────────────┼────────────────┤
│"Pepe Reina"              │2               │
├──────────────────────────┼────────────────┤
│"Sergio Ramos"            │2               │
├──────────────────────────┼────────────────┤
│"Fernando Torres"         │2               │
├──────────────────────────┼────────────────┤
│"Carlos Marchena"         │2               │
├──────────────────────────┼────────────────┤
│"Xabi Alonso"             │2               │
├──────────────────────────┼────────────────┤
│"David Villa"             │2               │
├──────────────────────────┼────────────────┤
│"Aaron Mokoena"           │2               │
├──────────────────────────┼────────────────┤
│"Steven Pienaar"          │2               │
├──────────────────────────┼────────────────┤
│"Siyabonga Nomvethe"      │2               │
├──────────────────────────┼────────────────┤
│"Macbeth Sibaya"          │2               │
├──────────────────────────┼────────────────┤
│"Vladimir Stojkovic"      │2               │
├──────────────────────────┼────────────────┤
│"Nemanja Vidic"           │2               │
├──────────────────────────┼────────────────┤
│"Nikola Zigic"            │2               │
├──────────────────────────┼────────────────┤
│"Daniele De Rossi"        │2               │
├──────────────────────────┼────────────────┤
│"Alberto Gilardino"       │2               │
├──────────────────────────┼────────────────┤
│"Vincenzo Iaquinta"       │2               │
├──────────────────────────┼────────────────┤
│"Andrea Pirlo"            │2               │
├──────────────────────────┼────────────────┤
│"Mauro Camoranesi"        │2               │
├──────────────────────────┼────────────────┤
│"Bastian Schweinsteiger"  │2               │
├──────────────────────────┼────────────────┤
│"Per Mertesacker"         │2               │
├──────────────────────────┼────────────────┤
│"Marcell Jansen"          │2               │
├──────────────────────────┼────────────────┤
│"Hans Joerg Butt"         │2               │
├──────────────────────────┼────────────────┤
│"Arne Friedrich"          │2               │
├──────────────────────────┼────────────────┤
│"Lukas Podolski"          │2               │
├──────────────────────────┼────────────────┤
│"Philipp Lahm"            │2               │
├──────────────────────────┼────────────────┤
│"Arthur Boka"             │2               │
├──────────────────────────┼────────────────┤
│"Yaya Toure"              │2               │
├──────────────────────────┼────────────────┤
│"Kolo Toure"              │2               │
├──────────────────────────┼────────────────┤
│"Romaric"                 │2               │
├──────────────────────────┼────────────────┤
│"Guy Demel"               │2               │
├──────────────────────────┼────────────────┤
│"Didier Zokora"           │2               │
├──────────────────────────┼────────────────┤
│"Didier Drogba"           │2               │
├──────────────────────────┼────────────────┤
│"Boubacar Barry"          │2               │
├──────────────────────────┼────────────────┤
│"Kader Keita"             │2               │
├──────────────────────────┼────────────────┤
│"Emmanuel Eboue"          │2               │
├──────────────────────────┼────────────────┤
│"Aruna Dindane"           │2               │
├──────────────────────────┼────────────────┤
│"Guillermo Franco"        │2               │
├──────────────────────────┼────────────────┤
│"Francisco Rodriguez"     │2               │
├──────────────────────────┼────────────────┤
│"Andres Guardado"         │2               │
├──────────────────────────┼────────────────┤
│"Guillermo Ochoa"         │2               │
├──────────────────────────┼────────────────┤
│"Carlos Salcido"          │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Osorio"          │2               │
├──────────────────────────┼────────────────┤
│"Cha Duri"                │2               │
├──────────────────────────┼────────────────┤
│"Lee Dong Gook"           │2               │
├──────────────────────────┼────────────────┤
│"Kim Youngkwang"          │2               │
├──────────────────────────┼────────────────┤
│"Park Chuyoung"           │2               │
├──────────────────────────┼────────────────┤
│"Kim Dong Jin"            │2               │
├──────────────────────────┼────────────────┤
│"Idriss Kameni"           │2               │
├──────────────────────────┼────────────────┤
│"Geremi"                  │2               │
├──────────────────────────┼────────────────┤
│"Emile Heskey"            │2               │
├──────────────────────────┼────────────────┤
│"Wayne Rooney"            │2               │
├──────────────────────────┼────────────────┤
│"Steven Gerrard"          │2               │
├──────────────────────────┼────────────────┤
│"Michael Carrick"         │2               │
├──────────────────────────┼────────────────┤
│"Peter Crouch"            │2               │
├──────────────────────────┼────────────────┤
│"John Terry"              │2               │
├──────────────────────────┼────────────────┤
│"Jamie Carragher"         │2               │
├──────────────────────────┼────────────────┤
│"Frank Lampard"           │2               │
├──────────────────────────┼────────────────┤
│"Aaron Lennon"            │2               │
├──────────────────────────┼────────────────┤
│"Thomas Sorensen"         │2               │
├──────────────────────────┼────────────────┤
│"Jesper Gronkjaer"        │2               │
├──────────────────────────┼────────────────┤
│"Dennis Rommedahl"        │2               │
├──────────────────────────┼────────────────┤
│"Jesper Christiansen"     │2               │
├──────────────────────────┼────────────────┤
│"Christian Poulsen"       │2               │
├──────────────────────────┼────────────────┤
│"Jon Dahl Tomasson"       │2               │
├──────────────────────────┼────────────────┤
│"Miguel"                  │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Carvalho"        │2               │
├──────────────────────────┼────────────────┤
│"Cristiano Ronaldo"       │2               │
├──────────────────────────┼────────────────┤
│"Paulo Ferreira"          │2               │
├──────────────────────────┼────────────────┤
│"Tiago"                   │2               │
├──────────────────────────┼────────────────┤
│"Simao"                   │2               │
├──────────────────────────┼────────────────┤
│"Deco"                    │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Costa"           │2               │
├──────────────────────────┼────────────────┤
│"Ryan Babel"              │2               │
├──────────────────────────┼────────────────┤
│"Rafael Van Der Vaart"    │2               │
├──────────────────────────┼────────────────┤
│"John Heitinga"           │2               │
├──────────────────────────┼────────────────┤
│"Joris Mathijsen"         │2               │
├──────────────────────────┼────────────────┤
│"Wesley Sneijder"         │2               │
├──────────────────────────┼────────────────┤
│"Dirk Kuyt"               │2               │
├──────────────────────────┼────────────────┤
│"Maarten Stekelenburg"    │2               │
├──────────────────────────┼────────────────┤
│"Khalid Boulahrouz"       │2               │
├──────────────────────────┼────────────────┤
│"Arjen Robben"            │2               │
├──────────────────────────┼────────────────┤
│"Robin Van Persie"        │2               │
├──────────────────────────┼────────────────┤
│"Mark Van Bommel"         │2               │
├──────────────────────────┼────────────────┤
│"Yasuhito Endo"           │2               │
├──────────────────────────┼────────────────┤
│"Keiji Tamada"            │2               │
├──────────────────────────┼────────────────┤
│"Yuichi Komano"           │2               │
├──────────────────────────┼────────────────┤
│"Yuji Nakazawa"           │2               │
├──────────────────────────┼────────────────┤
│"Shunsuke Nakamura"       │2               │
├──────────────────────────┼────────────────┤
│"Eric Abidal"             │2               │
├──────────────────────────┼────────────────┤
│"Sidney Govou"            │2               │
├──────────────────────────┼────────────────┤
│"William Gallas"          │2               │
├──────────────────────────┼────────────────┤
│"Djibril Cisse"           │2               │
├──────────────────────────┼────────────────┤
│"Franck Ribery"           │2               │
├──────────────────────────┼────────────────┤
│"Florent Malouda"         │2               │
├──────────────────────────┼────────────────┤
│"Alou Diarra"             │2               │
├──────────────────────────┼────────────────┤
│"Richard Kingson"         │2               │
├──────────────────────────┼────────────────┤
│"Matthew Amoah"           │2               │
├──────────────────────────┼────────────────┤
│"Stephen Appiah"          │2               │
├──────────────────────────┼────────────────┤
│"Derek Boateng"           │2               │
├──────────────────────────┼────────────────┤
│"Sulley Muntari"          │2               │
├──────────────────────────┼────────────────┤
│"Asamoah Gyan"            │2               │
├──────────────────────────┼────────────────┤
│"Hans Sarpei"             │2               │
├──────────────────────────┼────────────────┤
│"John Pantsil"            │2               │
├──────────────────────────┼────────────────┤
│"John Mensah"             │2               │
├──────────────────────────┼────────────────┤
│"Aldo Bobadilla"          │2               │
├──────────────────────────┼────────────────┤
│"Nelson Valdez"           │2               │
├──────────────────────────┼────────────────┤
│"Paulo Da Silva"          │2               │
├──────────────────────────┼────────────────┤
│"Cristian Riveros"        │2               │
├──────────────────────────┼────────────────┤
│"Edgar Barreto"           │2               │
├──────────────────────────┼────────────────┤
│"Joseph Yobo"             │2               │
├──────────────────────────┼────────────────┤
│"Rabiu Afolabi"           │2               │
├──────────────────────────┼────────────────┤
│"John Utaka"              │2               │
├──────────────────────────┼────────────────┤
│"Austine Ejide"           │2               │
├──────────────────────────┼────────────────┤
│"Vincent Enyeama"         │2               │
├──────────────────────────┼────────────────┤
│"Craig Moore"             │2               │
├──────────────────────────┼────────────────┤
│"Scott Chipperfield"      │2               │
├──────────────────────────┼────────────────┤
│"Michael Beauchamp"       │2               │
├──────────────────────────┼────────────────┤
│"Harry Kewell"            │2               │
├──────────────────────────┼────────────────┤
│"Mark Bresciano"          │2               │
├──────────────────────────┼────────────────┤
│"Mark Schwarzer"          │2               │
├──────────────────────────┼────────────────┤
│"Vince Grella"            │2               │
├──────────────────────────┼────────────────┤
│"Tim Cahill"              │2               │
├──────────────────────────┼────────────────┤
│"Lucas Neill"             │2               │
├──────────────────────────┼────────────────┤
│"Luke Wilkshire"          │2               │
├──────────────────────────┼────────────────┤
│"Brett Emerton"           │2               │
├──────────────────────────┼────────────────┤
│"Mark Milligan"           │2               │
├──────────────────────────┼────────────────┤
│"Joshua Kennedy"          │2               │
├──────────────────────────┼────────────────┤
│"Jason Culina"            │2               │
├──────────────────────────┼────────────────┤
│"Robinho"                 │2               │
├──────────────────────────┼────────────────┤
│"Kleberson"               │2               │
├──────────────────────────┼────────────────┤
│"Gilberto Melo"           │2               │
├──────────────────────────┼────────────────┤
│"Juan"                    │2               │
├──────────────────────────┼────────────────┤
│"Luisao"                  │2               │
├──────────────────────────┼────────────────┤
│"Julio Cesar"             │2               │
├──────────────────────────┼────────────────┤
│"Walter Samuel"           │2               │
├──────────────────────────┼────────────────┤
│"Gabriel Heinze"          │2               │
├──────────────────────────┼────────────────┤
│"Javier Mascherano"       │2               │
├──────────────────────────┼────────────────┤
│"Lionel Messi"            │2               │
├──────────────────────────┼────────────────┤
│"Nicolas Burdisso"        │2               │
├──────────────────────────┼────────────────┤
│"Carlos Tevez"            │2               │
├──────────────────────────┼────────────────┤
│"Maxi Rodriguez"          │2               │
├──────────────────────────┼────────────────┤
│"Savo Milosevic"          │2               │
├──────────────────────────┼────────────────┤
│"Erik Edman"              │2               │
├──────────────────────────┼────────────────┤
│"Olof Mellberg"           │2               │
├──────────────────────────┼────────────────┤
│"Zlatan Ibrahimovic"      │2               │
├──────────────────────────┼────────────────┤
│"Tobias Linderoth"        │2               │
├──────────────────────────┼────────────────┤
│"Fredrik Ljungberg"       │2               │
├──────────────────────────┼────────────────┤
│"Marcus Allback"          │2               │
├──────────────────────────┼────────────────┤
│"Niclas Alexandersson"    │2               │
├──────────────────────────┼────────────────┤
│"Andreas Isaksson"        │2               │
├──────────────────────────┼────────────────┤
│"Daniel Andersson"        │2               │
├──────────────────────────┼────────────────┤
│"Anders Svensson"         │2               │
├──────────────────────────┼────────────────┤
│"Mattias Jonson"          │2               │
├──────────────────────────┼────────────────┤
│"Marco Materazzi"         │2               │
├──────────────────────────┼────────────────┤
│"Francesco Totti"         │2               │
├──────────────────────────┼────────────────┤
│"Josh Wolff"              │2               │
├──────────────────────────┼────────────────┤
│"John O Brien"            │2               │
├──────────────────────────┼────────────────┤
│"Pablo Mastroeni"         │2               │
├──────────────────────────┼────────────────┤
│"Gregg Berhalter"         │2               │
├──────────────────────────┼────────────────┤
│"Eddie Lewis"             │2               │
├──────────────────────────┼────────────────┤
│"Takashi Fukunishi"       │2               │
├──────────────────────────┼────────────────┤
│"Atsushi Yanagisawa"      │2               │
├──────────────────────────┼────────────────┤
│"Koji Nakata"             │2               │
├──────────────────────────┼────────────────┤
│"Mitsuo Ogasawara"        │2               │
├──────────────────────────┼────────────────┤
│"Tsuneyasu Miyamoto"      │2               │
├──────────────────────────┼────────────────┤
│"Alessandro Santos"       │2               │
├──────────────────────────┼────────────────┤
│"Ramon Morales"           │2               │
├──────────────────────────┼────────────────┤
│"Pavel Pardo"             │2               │
├──────────────────────────┼────────────────┤
│"Rafael Garcia"           │2               │
├──────────────────────────┼────────────────┤
│"Jared Borgetti"          │2               │
├──────────────────────────┼────────────────┤
│"Zied Jaziri"             │2               │
├──────────────────────────┼────────────────┤
│"Radhi Jaidi"             │2               │
├──────────────────────────┼────────────────┤
│"Joaquin"                 │2               │
├──────────────────────────┼────────────────┤
│"David Albelda"           │2               │
├──────────────────────────┼────────────────┤
│"Luis Figo"               │2               │
├──────────────────────────┼────────────────┤
│"Nuno Gomes"              │2               │
├──────────────────────────┼────────────────┤
│"Pauleta"                 │2               │
├──────────────────────────┼────────────────┤
│"Ricardo"                 │2               │
├──────────────────────────┼────────────────┤
│"Marco Caneira"           │2               │
├──────────────────────────┼────────────────┤
│"Petit"                   │2               │
├──────────────────────────┼────────────────┤
│"Hugo Viana"              │2               │
├──────────────────────────┼────────────────┤
│"Phillip Cocu"            │2               │
├──────────────────────────┼────────────────┤
│"Mohammed Noor"           │2               │
├──────────────────────────┼────────────────┤
│"Redha Tukar"             │2               │
├──────────────────────────┼────────────────┤
│"Mabrouk Zaid"            │2               │
├──────────────────────────┼────────────────┤
│"Mohammad Al Shalhoub"    │2               │
├──────────────────────────┼────────────────┤
│"Omar Al Ghamdi"          │2               │
├──────────────────────────┼────────────────┤
│"Abdulaziz Khathran"      │2               │
├──────────────────────────┼────────────────┤
│"Lee Chun Soo"            │2               │
├──────────────────────────┼────────────────┤
│"Choi Jin Cheul"          │2               │
├──────────────────────────┼────────────────┤
│"Lee Eul Yong"            │2               │
├──────────────────────────┼────────────────┤
│"Song Chong Gug"          │2               │
├──────────────────────────┼────────────────┤
│"Seol Ki Hyeon"           │2               │
├──────────────────────────┼────────────────┤
│"Diego Gavilan"           │2               │
├──────────────────────────┼────────────────┤
│"Nelson Cuevas"           │2               │
├──────────────────────────┼────────────────┤
│"Michal Zewlakow"         │2               │
├──────────────────────────┼────────────────┤
│"Jacek Bak"               │2               │
├──────────────────────────┼────────────────┤
│"Maciej Zurawski"         │2               │
├──────────────────────────┼────────────────┤
│"Jacek Krzynowek"         │2               │
├──────────────────────────┼────────────────┤
│"Michael Ballack"         │2               │
├──────────────────────────┼────────────────┤
│"Torsten Frings"          │2               │
├──────────────────────────┼────────────────┤
│"Sebastian Kehl"          │2               │
├──────────────────────────┼────────────────┤
│"Oliver Neuville"         │2               │
├──────────────────────────┼────────────────┤
│"Gerald Asamoah"          │2               │
├──────────────────────────┼────────────────┤
│"Bernd Schneider"         │2               │
├──────────────────────────┼────────────────┤
│"Christoph Metzelder"     │2               │
├──────────────────────────┼────────────────┤
│"Owen Hargreaves"         │2               │
├──────────────────────────┼────────────────┤
│"Gary Neville"            │2               │
├──────────────────────────┼────────────────┤
│"Wayne Bridge"            │2               │
├──────────────────────────┼────────────────┤
│"Ali Daei"                │2               │
├──────────────────────────┼────────────────┤
│"Mehdi Mahdavikia"        │2               │
├──────────────────────────┼────────────────┤
│"Willy Sagnol"            │2               │
├──────────────────────────┼────────────────┤
│"Gregory Coupet"          │2               │
├──────────────────────────┼────────────────┤
│"Claude Makelele"         │2               │
├──────────────────────────┼────────────────┤
│"Mikael Silvestre"        │2               │
├──────────────────────────┼────────────────┤
│"Sylvain Wiltord"         │2               │
├──────────────────────────┼────────────────┤
│"Rogerio Ceni"            │2               │
├──────────────────────────┼────────────────┤
│"Ronaldinho"              │2               │
├──────────────────────────┼────────────────┤
│"Ze Roberto"              │2               │
├──────────────────────────┼────────────────┤
│"Emerson"                 │2               │
├──────────────────────────┼────────────────┤
│"Ricardinho"              │2               │
├──────────────────────────┼────────────────┤
│"Ivan Kaviedes"           │2               │
├──────────────────────────┼────────────────┤
│"Edison Mendez"           │2               │
├──────────────────────────┼────────────────┤
│"Edwin Tenorio"           │2               │
├──────────────────────────┼────────────────┤
│"Carlos Tenorio"          │2               │
├──────────────────────────┼────────────────┤
│"Marlon Ayovi"            │2               │
├──────────────────────────┼────────────────┤
│"Giovanny Espinoza"       │2               │
├──────────────────────────┼────────────────┤
│"Agustin Delgado"         │2               │
├──────────────────────────┼────────────────┤
│"Ulises De La Cruz"       │2               │
├──────────────────────────┼────────────────┤
│"Ivan Hurtado"            │2               │
├──────────────────────────┼────────────────┤
│"Niko Kovac"              │2               │
├──────────────────────────┼────────────────┤
│"Stipe Pletikosa"         │2               │
├──────────────────────────┼────────────────┤
│"Josip Simunic"           │2               │
├──────────────────────────┼────────────────┤
│"Tomislav Butina"         │2               │
├──────────────────────────┼────────────────┤
│"Jurica Vranjes"          │2               │
├──────────────────────────┼────────────────┤
│"Robert Kovac"            │2               │
├──────────────────────────┼────────────────┤
│"Ivica Olic"              │2               │
├──────────────────────────┼────────────────┤
│"Bosko Balaban"           │2               │
├──────────────────────────┼────────────────┤
│"Igor Tudor"              │2               │
├──────────────────────────┼────────────────┤
│"Stjepan Tomas"           │2               │
├──────────────────────────┼────────────────┤
│"Paulo Wanchope"          │2               │
├──────────────────────────┼────────────────┤
│"Walter Centeno"          │2               │
├──────────────────────────┼────────────────┤
│"Luis Marin"              │2               │
├──────────────────────────┼────────────────┤
│"Jervis Drummond"         │2               │
├──────────────────────────┼────────────────┤
│"Ronald Gomez"            │2               │
├──────────────────────────┼────────────────┤
│"Mauricio Solis"          │2               │
├──────────────────────────┼────────────────┤
│"Gilberto Martinez"       │2               │
├──────────────────────────┼────────────────┤
│"Alvaro Mesen"            │2               │
├──────────────────────────┼────────────────┤
│"Harold Wallace"          │2               │
├──────────────────────────┼────────────────┤
│"Juan Sorin"              │2               │
├──────────────────────────┼────────────────┤
│"Pablo Aimar"             │2               │
├──────────────────────────┼────────────────┤
│"Frankie Hejduk"          │2               │
├──────────────────────────┼────────────────┤
│"David Regis"             │2               │
├──────────────────────────┼────────────────┤
│"Jeff Agoos"              │2               │
├──────────────────────────┼────────────────┤
│"Tarek Thabet"            │2               │
├──────────────────────────┼────────────────┤
│"Clayton"                 │2               │
├──────────────────────────┼────────────────┤
│"Zoubeir Beya"            │2               │
├──────────────────────────┼────────────────┤
│"Riadh Jelassi"           │2               │
├──────────────────────────┼────────────────┤
│"Adel El Sellimi"         │2               │
├──────────────────────────┼────────────────┤
│"Mourad El Melki"         │2               │
├──────────────────────────┼────────────────┤
│"Khaled Badra"            │2               │
├──────────────────────────┼────────────────┤
│"Magnus Hedman"           │2               │
├──────────────────────────┼────────────────┤
│"Patrik Andersson"        │2               │
├──────────────────────────┼────────────────┤
│"Pierre Issa"             │2               │
├──────────────────────────┼────────────────┤
│"Hans Vonk"               │2               │
├──────────────────────────┼────────────────┤
│"Delron Buckley"          │2               │
├──────────────────────────┼────────────────┤
│"Benni Mccarthy"          │2               │
├──────────────────────────┼────────────────┤
│"Lucas Radebe"            │2               │
├──────────────────────────┼────────────────┤
│"Quinton Fortune"         │2               │
├──────────────────────────┼────────────────┤
│"Fernando Morientes"      │2               │
├──────────────────────────┼────────────────┤
│"Taribo West"             │2               │
├──────────────────────────┼────────────────┤
│"Celestine Babayaro"      │2               │
├──────────────────────────┼────────────────┤
│"Garba Lawal"             │2               │
├──────────────────────────┼────────────────┤
│"Roy Keane"               │2               │
├──────────────────────────┼────────────────┤
│"Niall Quinn"             │2               │
├──────────────────────────┼────────────────┤
│"Gary Kelly"              │2               │
├──────────────────────────┼────────────────┤
│"Alan Kelly Jr."          │2               │
├──────────────────────────┼────────────────┤
│"Jason Mcateer"           │2               │
├──────────────────────────┼────────────────┤
│"Christian Vieri"         │2               │
├──────────────────────────┼────────────────┤
│"Luigi Di Biagio"         │2               │
├──────────────────────────┼────────────────┤
│"Francesco Toldo"         │2               │
├──────────────────────────┼────────────────┤
│"Angelo Di Livio"         │2               │
├──────────────────────────┼────────────────┤
│"Toshihiro Hattori"       │2               │
├──────────────────────────┼────────────────┤
│"Hiroaki Morishima"       │2               │
├──────────────────────────┼────────────────┤
│"Yutaka Akita"            │2               │
├──────────────────────────┼────────────────┤
│"Masashi Nakayama"        │2               │
├──────────────────────────┼────────────────┤
│"Vincent Candela"         │2               │
├──────────────────────────┼────────────────┤
│"Youri Djorkaeff"         │2               │
├──────────────────────────┼────────────────┤
│"Christophe Dugarry"      │2               │
├──────────────────────────┼────────────────┤
│"Bixente Lizarazu"        │2               │
├──────────────────────────┼────────────────┤
│"Marcel Desailly"         │2               │
├──────────────────────────┼────────────────┤
│"Alain Boghossian"        │2               │
├──────────────────────────┼────────────────┤
│"Emmanuel Petit"          │2               │
├──────────────────────────┼────────────────┤
│"Frank Leboeuf"           │2               │
├──────────────────────────┼────────────────┤
│"Hernan Medford"          │2               │
├──────────────────────────┼────────────────┤
│"German Villa"            │2               │
├──────────────────────────┼────────────────┤
│"Salvador Carmona"        │2               │
├──────────────────────────┼────────────────┤
│"Braulio Luna"            │2               │
├──────────────────────────┼────────────────┤
│"Luis Hernandez"          │2               │
├──────────────────────────┼────────────────┤
│"Francisco Palencia"      │2               │
├──────────────────────────┼────────────────┤
│"Pedro Sarabia"           │2               │
├──────────────────────────┼────────────────┤
│"Jorge Campos"            │2               │
├──────────────────────────┼────────────────┤
│"Francisco Arce"          │2               │
├──────────────────────────┼────────────────┤
│"Jose Cardozo"            │2               │
├──────────────────────────┼────────────────┤
│"Celso Ayala"             │2               │
├──────────────────────────┼────────────────┤
│"Jose Luis Chilavert"     │2               │
├──────────────────────────┼────────────────┤
│"Mohammed Al Jahani"      │2               │
├──────────────────────────┼────────────────┤
│"Khamis Al Dossari"       │2               │
├──────────────────────────┼────────────────┤
│"Ibrahim Al Shahrani"     │2               │
├──────────────────────────┼────────────────┤
│"Obeid Al Dosari"         │2               │
├──────────────────────────┼────────────────┤
│"Vladimir Vasilj"         │2               │
├──────────────────────────┼────────────────┤
│"Zvonimir Soldo"          │2               │
├──────────────────────────┼────────────────┤
│"Alen Boksic"             │2               │
├──────────────────────────┼────────────────┤
│"Goran Vlaovic"           │2               │
├──────────────────────────┼────────────────┤
│"Mario Stanic"            │2               │
├──────────────────────────┼────────────────┤
│"Peter Kjaer"             │2               │
├──────────────────────────┼────────────────┤
│"Ebbe Sand"               │2               │
├──────────────────────────┼────────────────┤
│"Thomas Helveg"           │2               │
├──────────────────────────┼────────────────┤
│"Rene Henriksen"          │2               │
├──────────────────────────┼────────────────┤
│"Jan Heintze"             │2               │
├──────────────────────────┼────────────────┤
│"Stig Tofting"            │2               │
├──────────────────────────┼────────────────┤
│"Joseph-desire Job"       │2               │
├──────────────────────────┼────────────────┤
│"Pierre Njanka"           │2               │
├──────────────────────────┼────────────────┤
│"Marc-vivien Foe"         │2               │
├──────────────────────────┼────────────────┤
│"Joseph Ndo"              │2               │
├──────────────────────────┼────────────────┤
│"Patrick Mboma"           │2               │
├──────────────────────────┼────────────────┤
│"Salomon Olembe"          │2               │
├──────────────────────────┼────────────────┤
│"Pierre Wome"             │2               │
├──────────────────────────┼────────────────┤
│"Lauren"                  │2               │
├──────────────────────────┼────────────────┤
│"Alioum Boukar"           │2               │
├──────────────────────────┼────────────────┤
│"Yuri Nikiforov"          │2               │
├──────────────────────────┼────────────────┤
│"Valeri Karpin"           │2               │
├──────────────────────────┼────────────────┤
│"Vladimir Beschastnykh"   │2               │
├──────────────────────────┼────────────────┤
│"Stanislav Cherchesov"    │2               │
├──────────────────────────┼────────────────┤
│"Aleksandr Mostovoi"      │2               │
├──────────────────────────┼────────────────┤
│"Viktor Onopko"           │2               │
├──────────────────────────┼────────────────┤
│"Jens Jeremies"           │2               │
├──────────────────────────┼────────────────┤
│"Didi Hamann"             │2               │
├──────────────────────────┼────────────────┤
│"Christian Ziege"         │2               │
├──────────────────────────┼────────────────┤
│"Oliver Bierhoff"         │2               │
├──────────────────────────┼────────────────┤
│"Kim Tae Young"           │2               │
├──────────────────────────┼────────────────┤
│"Choi Sung Yong"          │2               │
├──────────────────────────┼────────────────┤
│"Yoo Sang Chul"           │2               │
├──────────────────────────┼────────────────┤
│"Kim Byung Ji"            │2               │
├──────────────────────────┼────────────────┤
│"Choi Yongsoo"            │2               │
├──────────────────────────┼────────────────┤
│"Lee Min Sung"            │2               │
├──────────────────────────┼────────────────┤
│"Gareth Southgate"        │2               │
├──────────────────────────┼────────────────┤
│"Teddy Sheringham"        │2               │
├──────────────────────────┼────────────────┤
│"Martin Keown"            │2               │
├──────────────────────────┼────────────────┤
│"Paul Scholes"            │2               │
├──────────────────────────┼────────────────┤
│"Nigel Martyn"            │2               │
├──────────────────────────┼────────────────┤
│"Nico Van Kerckhoven"     │2               │
├──────────────────────────┼────────────────┤
│"Glen De Boeck"           │2               │
├──────────────────────────┼────────────────┤
│"Eric Deflandre"          │2               │
├──────────────────────────┼────────────────┤
│"Gert Verheyen"           │2               │
├──────────────────────────┼────────────────┤
│"Mbo Mpenza"              │2               │
├──────────────────────────┼────────────────┤
│"Rivaldo"                 │2               │
├──────────────────────────┼────────────────┤
│"Denilson"                │2               │
├──────────────────────────┼────────────────┤
│"Claudio Lopez"           │2               │
├──────────────────────────┼────────────────┤
│"Pablo Cavallero"         │2               │
├──────────────────────────┼────────────────┤
│"German Burgos"           │2               │
├──────────────────────────┼────────────────┤
│"Matias Almeyda"          │2               │
├──────────────────────────┼────────────────┤
│"Marcelo Gallardo"        │2               │
├──────────────────────────┼────────────────┤
│"Javier Zanetti"          │2               │
├──────────────────────────┼────────────────┤
│"Ronald De Boer"          │2               │
├──────────────────────────┼────────────────┤
│"Marc Overmars"           │2               │
├──────────────────────────┼────────────────┤
│"Ed De Goey"              │2               │
├──────────────────────────┼────────────────┤
│"Frank De Boer"           │2               │
├──────────────────────────┼────────────────┤
│"Dennis Bergkamp"         │2               │
├──────────────────────────┼────────────────┤
│"Arthur Numan"            │2               │
├──────────────────────────┼────────────────┤
│"Wim Jonk"                │2               │
├──────────────────────────┼────────────────┤
│"Dan Petrescu"            │2               │
├──────────────────────────┼────────────────┤
│"Marius Lacatus"          │2               │
├──────────────────────────┼────────────────┤
│"Tibor Selymes"           │2               │
├──────────────────────────┼────────────────┤
│"Florin Prunea"           │2               │
├──────────────────────────┼────────────────┤
│"Dorinel Munteanu"        │2               │
├──────────────────────────┼────────────────┤
│"Ovidiu Stanga"           │2               │
├──────────────────────────┼────────────────┤
│"Constantin Galca"        │2               │
├──────────────────────────┼────────────────┤
│"Viorel Moldovan"         │2               │
├──────────────────────────┼────────────────┤
│"Dragoje Lekovic"         │2               │
├──────────────────────────┼────────────────┤
│"Dragan Stojkovic"        │2               │
├──────────────────────────┼────────────────┤
│"Dejan Savicevic"         │2               │
├──────────────────────────┼────────────────┤
│"Gordon Durie"            │2               │
├──────────────────────────┼────────────────┤
│"John Collins"            │2               │
├──────────────────────────┼────────────────┤
│"Lee Sang Yoon"           │2               │
├──────────────────────────┼────────────────┤
│"Ha Seok Ju"              │2               │
├──────────────────────────┼────────────────┤
│"Noh Jung Yoon"           │2               │
├──────────────────────────┼────────────────┤
│"Seo Jung Won"            │2               │
├──────────────────────────┼────────────────┤
│"Choi Young Il"           │2               │
├──────────────────────────┼────────────────┤
│"Ramon Ramirez"           │2               │
├──────────────────────────┼────────────────┤
│"Marcelino Bernal"        │2               │
├──────────────────────────┼────────────────┤
│"Luis Garcia"             │2               │
├──────────────────────────┼────────────────┤
│"Abelardo"                │2               │
├──────────────────────────┼────────────────┤
│"Julen Guerrero"          │2               │
├──────────────────────────┼────────────────┤
│"Sergi"                   │2               │
├──────────────────────────┼────────────────┤
│"Albert Ferrer"           │2               │
├──────────────────────────┼────────────────┤
│"Demetrio Albertini"      │2               │
├──────────────────────────┼────────────────┤
│"Alessandro Costacurta"   │2               │
├──────────────────────────┼────────────────┤
│"Dino Baggio"             │2               │
├──────────────────────────┼────────────────┤
│"Abdelkarim El Hadrioui"  │2               │
├──────────────────────────┼────────────────┤
│"Noureddine Naybet"       │2               │
├──────────────────────────┼────────────────┤
│"Rachid Azzouzi"          │2               │
├──────────────────────────┼────────────────┤
│"Smahi Triki"             │2               │
├──────────────────────────┼────────────────┤
│"Mustafa El Hadji"        │2               │
├──────────────────────────┼────────────────┤
│"Rachid Neqrouz"          │2               │
├──────────────────────────┼────────────────┤
│"Taher El Khalej"         │2               │
├──────────────────────────┼────────────────┤
│"Mike Burns"              │2               │
├──────────────────────────┼────────────────┤
│"Juergen Sommer"          │2               │
├──────────────────────────┼────────────────┤
│"Roy Wegerle"             │2               │
├──────────────────────────┼────────────────┤
│"Thomas Dooley"           │2               │
├──────────────────────────┼────────────────┤
│"Alexi Lalas"             │2               │
├──────────────────────────┼────────────────┤
│"Gunnar Halle"            │2               │
├──────────────────────────┼────────────────┤
│"Oyvind Leonhardsen"      │2               │
├──────────────────────────┼────────────────┤
│"Dan Eggen"               │2               │
├──────────────────────────┼────────────────┤
│"Henning Berg"            │2               │
├──────────────────────────┼────────────────┤
│"Kjetil Rekdal"           │2               │
├──────────────────────────┼────────────────┤
│"Erik Mykland"            │2               │
├──────────────────────────┼────────────────┤
│"Jostein Flo"             │2               │
├──────────────────────────┼────────────────┤
│"Mini Jakobsen"           │2               │
├──────────────────────────┼────────────────┤
│"Frode Grodas"            │2               │
├──────────────────────────┼────────────────┤
│"Roar Strand"             │2               │
├──────────────────────────┼────────────────┤
│"Stig Bjornebye"          │2               │
├──────────────────────────┼────────────────┤
│"Fahad Al Mehalel"        │2               │
├──────────────────────────┼────────────────┤
│"Ahmed Madani"            │2               │
├──────────────────────────┼────────────────┤
│"Hussein Al Sadeq"        │2               │
├──────────────────────────┼────────────────┤
│"Said Al Owairan"         │2               │
├──────────────────────────┼────────────────┤
│"Hamza Saleh"             │2               │
├──────────────────────────┼────────────────┤
│"Fuad Amin"               │2               │
├──────────────────────────┼────────────────┤
│"Khaled Al Muwallid"      │2               │
├──────────────────────────┼────────────────┤
│"Mohammed Al Khilaiwi"    │2               │
├──────────────────────────┼────────────────┤
│"Uche Okechukwu"          │2               │
├──────────────────────────┼────────────────┤
│"Peter Rufai"             │2               │
├──────────────────────────┼────────────────┤
│"Finidi George"           │2               │
├──────────────────────────┼────────────────┤
│"Sunday Oliseh"           │2               │
├──────────────────────────┼────────────────┤
│"Ben Iroha"               │2               │
├──────────────────────────┼────────────────┤
│"Uche Okafor"             │2               │
├──────────────────────────┼────────────────┤
│"Daniel Amokachi"         │2               │
├──────────────────────────┼────────────────┤
│"Augustine Eguavoen"      │2               │
├──────────────────────────┼────────────────┤
│"Rasheed Yekini"          │2               │
├──────────────────────────┼────────────────┤
│"Victor Ikpeba"           │2               │
├──────────────────────────┼────────────────┤
│"Stefan Reuter"           │2               │
├──────────────────────────┼────────────────┤
│"Ulf Kirsten"             │2               │
├──────────────────────────┼────────────────┤
│"Thomas Helmer"           │2               │
├──────────────────────────┼────────────────┤
│"Ivaylo Yordanov"         │2               │
├──────────────────────────┼────────────────┤
│"Emil Kostadinov"         │2               │
├──────────────────────────┼────────────────┤
│"Daniel Borimirov"        │2               │
├──────────────────────────┼────────────────┤
│"Krassimir Balakov"       │2               │
├──────────────────────────┼────────────────┤
│"Hristo Stoichkov"        │2               │
├──────────────────────────┼────────────────┤
│"Trifon Ivanov"           │2               │
├──────────────────────────┼────────────────┤
│"Heimo Pfeifenberger"     │2               │
├──────────────────────────┼────────────────┤
│"Anton Pfeffer"           │2               │
├──────────────────────────┼────────────────┤
│"Toni Polster"            │2               │
├──────────────────────────┼────────────────┤
│"Michael Konsel"          │2               │
├──────────────────────────┼────────────────┤
│"Peter Schoettel"         │2               │
├──────────────────────────┼────────────────┤
│"Andreas Herzog"          │2               │
├──────────────────────────┼────────────────┤
│"Alphonse-marie Tchami"   │2               │
├──────────────────────────┼────────────────┤
│"Luc Nilis"               │2               │
├──────────────────────────┼────────────────┤
│"Vital Borkelmans"        │2               │
├──────────────────────────┼────────────────┤
│"Dany Verlinden"          │2               │
├──────────────────────────┼────────────────┤
│"Faryd Mondragon"         │2               │
├──────────────────────────┼────────────────┤
│"Oscar Cordoba"           │2               │
├──────────────────────────┼────────────────┤
│"Mauricio Serna"          │2               │
├──────────────────────────┼────────────────┤
│"Adolfo Valencia"         │2               │
├──────────────────────────┼────────────────┤
│"Victor Aristizabal"      │2               │
├──────────────────────────┼────────────────┤
│"Faustino Asprilla"       │2               │
├──────────────────────────┼────────────────┤
│"Wilmer Cabrera"          │2               │
├──────────────────────────┼────────────────┤
│"Harold Lozano"           │2               │
├──────────────────────────┼────────────────┤
│"Anthony De Avila"        │2               │
├──────────────────────────┼────────────────┤
│"Michael Laudrup"         │2               │
├──────────────────────────┼────────────────┤
│"Leonardo"                │2               │
├──────────────────────────┼────────────────┤
│"Jose Maria Bakero"       │2               │
├──────────────────────────┼────────────────┤
│"Aleksandr Borodyuk"      │2               │
├──────────────────────────┼────────────────┤
│"Sergei Gorlukovich"      │2               │
├──────────────────────────┼────────────────┤
│"Jonas Thern"             │2               │
├──────────────────────────┼────────────────┤
│"Anders Limpar"           │2               │
├──────────────────────────┼────────────────┤
│"Klas Ingesson"           │2               │
├──────────────────────────┼────────────────┤
│"Tomas Brolin"            │2               │
├──────────────────────────┼────────────────┤
│"Roland Nilsson"          │2               │
├──────────────────────────┼────────────────┤
│"Lars Eriksson"           │2               │
├──────────────────────────┼────────────────┤
│"Stefan Schwarz"          │2               │
├──────────────────────────┼────────────────┤
│"Roger Ljung"             │2               │
├──────────────────────────┼────────────────┤
│"Thomas Ravelli"          │2               │
├──────────────────────────┼────────────────┤
│"John Harkes"             │2               │
├──────────────────────────┼────────────────┤
│"Paul Caligiuri"          │2               │
├──────────────────────────┼────────────────┤
│"Andy Townsend"           │2               │
├──────────────────────────┼────────────────┤
│"Kevin Moran"             │2               │
├──────────────────────────┼────────────────┤
│"John Sheridan"           │2               │
├──────────────────────────┼────────────────┤
│"Alan Mcloughlin"         │2               │
├──────────────────────────┼────────────────┤
│"John Aldridge"           │2               │
├──────────────────────────┼────────────────┤
│"Ray Houghton"            │2               │
├──────────────────────────┼────────────────┤
│"Ronnie Whelan"           │2               │
├──────────────────────────┼────────────────┤
│"Pat Bonner"              │2               │
├──────────────────────────┼────────────────┤
│"Paul Mcgrath"            │2               │
├──────────────────────────┼────────────────┤
│"Tony Cascarino"          │2               │
├──────────────────────────┼────────────────┤
│"David Kelly"             │2               │
├──────────────────────────┼────────────────┤
│"Florin Raducioiu"        │2               │
├──────────────────────────┼────────────────┤
│"Ioan Lupescu"            │2               │
├──────────────────────────┼────────────────┤
│"Mustapha El Hadaoui"     │2               │
├──────────────────────────┼────────────────┤
│"Choi In Young"           │2               │
├──────────────────────────┼────────────────┤
│"Gu Sang Bum"             │2               │
├──────────────────────────┼────────────────┤
│"Lee Young Jin"           │2               │
├──────────────────────────┼────────────────┤
│"Danny Blind"             │2               │
├──────────────────────────┼────────────────┤
│"Frank Rijkaard"          │2               │
├──────────────────────────┼────────────────┤
│"Ronald Koeman"           │2               │
├──────────────────────────┼────────────────┤
│"Jan Wouters"             │2               │
├──────────────────────────┼────────────────┤
│"Bryan Roy"               │2               │
├──────────────────────────┼────────────────┤
│"Carlos Hermosillo"       │2               │
├──────────────────────────┼────────────────┤
│"Marc Emmers"             │2               │
├──────────────────────────┼────────────────┤
│"Michel Preudhomme"       │2               │
├──────────────────────────┼────────────────┤
│"Philippe Albert"         │2               │
├──────────────────────────┼────────────────┤
│"Alex Czerniatynski"      │2               │
├──────────────────────────┼────────────────┤
│"Marc De Grijse"          │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Rocha"           │2               │
├──────────────────────────┼────────────────┤
│"Romário"                 │2               │
├──────────────────────────┼────────────────┤
│"Jorginho"                │2               │
├──────────────────────────┼────────────────┤
│"Mazinho"                 │2               │
├──────────────────────────┼────────────────┤
│"Jose Basualdo"           │2               │
├──────────────────────────┼────────────────┤
│"Luis Islas"              │2               │
├──────────────────────────┼────────────────┤
│"Sergio Goycochea"        │2               │
├──────────────────────────┼────────────────┤
│"Alexis Mendoza"          │2               │
├──────────────────────────┼────────────────┤
│"Luis Herrera"            │2               │
├──────────────────────────┼────────────────┤
│"Andres Escobar"          │2               │
├──────────────────────────┼────────────────┤
│"Gabriel Gomez"           │2               │
├──────────────────────────┼────────────────┤
│"Luis Carlos Perea"       │2               │
├──────────────────────────┼────────────────┤
│"Leonel Alvarez"          │2               │
├──────────────────────────┼────────────────┤
│"Karlheinz Riedle"        │2               │
├──────────────────────────┼────────────────┤
│"Bodo Illgner"            │2               │
├──────────────────────────┼────────────────┤
│"Guido Buchwald"          │2               │
├──────────────────────────┼────────────────┤
│"Victor Ndip"             │2               │
├──────────────────────────┼────────────────┤
│"Andre Kana-biyik"        │2               │
├──────────────────────────┼────────────────┤
│"Thomas Libiih"           │2               │
├──────────────────────────┼────────────────┤
│"Stephen Tataw"           │2               │
├──────────────────────────┼────────────────┤
│"Louis Mfede"             │2               │
├──────────────────────────┼────────────────┤
│"Emile Mbouh"             │2               │
├──────────────────────────┼────────────────┤
│"Emmanuel Maboang"        │2               │
├──────────────────────────┼────────────────┤
│"Nicola Berti"            │2               │
├──────────────────────────┼────────────────┤
│"Roberto Donadoni"        │2               │
├──────────────────────────┼────────────────┤
│"Daniele Massaro"         │2               │
├──────────────────────────┼────────────────┤
│"Nasko Sirakov"           │2               │
├──────────────────────────┼────────────────┤
│"Emilio Butragueno"       │2               │
├──────────────────────────┼────────────────┤
│"Chendo"                  │2               │
├──────────────────────────┼────────────────┤
│"Juan Carlos Ablanedo"    │2               │
├──────────────────────────┼────────────────┤
│"Michel"                  │2               │
├──────────────────────────┼────────────────┤
│"Zlatko Vujovic"          │2               │
├──────────────────────────┼────────────────┤
│"Safet Susic"             │2               │
├──────────────────────────┼────────────────┤
│"Ivan Yaremchuk"          │2               │
├──────────────────────────┼────────────────┤
│"Vasili Rats"             │2               │
├──────────────────────────┼────────────────┤
│"Oleg Kuznetsov"          │2               │
├──────────────────────────┼────────────────┤
│"Vagiz Khidiyatullin"     │2               │
├──────────────────────────┼────────────────┤
│"Gennadi Litovchenko"     │2               │
├──────────────────────────┼────────────────┤
│"Oleg Protasov"           │2               │
├──────────────────────────┼────────────────┤
│"Serguei Aleinikov"       │2               │
├──────────────────────────┼────────────────┤
│"Aleksandr Zavarov"       │2               │
├──────────────────────────┼────────────────┤
│"Viktor Chanov"           │2               │
├──────────────────────────┼────────────────┤
│"Maurice Malpas"          │2               │
├──────────────────────────┼────────────────┤
│"Richard Gough"           │2               │
├──────────────────────────┼────────────────┤
│"Andy Goram"              │2               │
├──────────────────────────┼────────────────┤
│"Roy Aitken"              │2               │
├──────────────────────────┼────────────────┤
│"Paul Mcstay"             │2               │
├──────────────────────────┼────────────────┤
│"Jim Bett"                │2               │
├──────────────────────────┼────────────────┤
│"Antonio Alzamendi"       │2               │
├──────────────────────────┼────────────────┤
│"Nelson Gutierrez"        │2               │
├──────────────────────────┼────────────────┤
│"Fernando Alvez"          │2               │
├──────────────────────────┼────────────────┤
│"Ruben Paz"               │2               │
├──────────────────────────┼────────────────┤
│"Enzo Francescoli"        │2               │
├──────────────────────────┼────────────────┤
│"Carlos Aguilera"         │2               │
├──────────────────────────┼────────────────┤
│"Lee Tae Ho"              │2               │
├──────────────────────────┼────────────────┤
│"Chung Yong Hwan"         │2               │
├──────────────────────────┼────────────────┤
│"Chung Jong Soo"          │2               │
├──────────────────────────┼────────────────┤
│"Cho Min Kook"            │2               │
├──────────────────────────┼────────────────┤
│"Park Kyung Hoon"         │2               │
├──────────────────────────┼────────────────┤
│"Choi Soon Ho"            │2               │
├──────────────────────────┼────────────────┤
│"Byun Byung Joo"          │2               │
├──────────────────────────┼────────────────┤
│"Noh Soo Jin"             │2               │
├──────────────────────────┼────────────────┤
│"Klaus Augenthaler"       │2               │
├──────────────────────────┼────────────────┤
│"Walter Zenga"            │2               │
├──────────────────────────┼────────────────┤
│"Aldo Serena"             │2               │
├──────────────────────────┼────────────────┤
│"Gianluca Vialli"         │2               │
├──────────────────────────┼────────────────┤
│"Fernando De Napoli"      │2               │
├──────────────────────────┼────────────────┤
│"Leo Clijsters"           │2               │
├──────────────────────────┼────────────────┤
│"Patrick Vervoort"        │2               │
├──────────────────────────┼────────────────┤
│"Gilbert Bodart"          │2               │
├──────────────────────────┼────────────────┤
│"Stephane Demol"          │2               │
├──────────────────────────┼────────────────┤
│"Nico Claesen"            │2               │
├──────────────────────────┼────────────────┤
│"Klaus Lindenberger"      │2               │
├──────────────────────────┼────────────────┤
│"Chris Waddle"            │2               │
├──────────────────────────┼────────────────┤
│"John Barnes"             │2               │
├──────────────────────────┼────────────────┤
│"Steve Hodge"             │2               │
├──────────────────────────┼────────────────┤
│"Gary Stevens"            │2               │
├──────────────────────────┼────────────────┤
│"Chris Woods"             │2               │
├──────────────────────────┼────────────────┤
│"Peter Beardsley"         │2               │
├──────────────────────────┼────────────────┤
│"Gary Lineker"            │2               │
├──────────────────────────┼────────────────┤
│"Trevor Steven"           │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Giusti"          │2               │
├──────────────────────────┼────────────────┤
│"Jorge Burruchaga"        │2               │
├──────────────────────────┼────────────────┤
│"Sergio Batista"          │2               │
├──────────────────────────┼────────────────┤
│"Gabriel Calderon"        │2               │
├──────────────────────────┼────────────────┤
│"Careca"                  │2               │
├──────────────────────────┼────────────────┤
│"Valdo"                   │2               │
├──────────────────────────┼────────────────┤
│"Alemao"                  │2               │
├──────────────────────────┼────────────────┤
│"Mauro Galvao"            │2               │
├──────────────────────────┼────────────────┤
│"Silas"                   │2               │
├──────────────────────────┼────────────────┤
│"Emmanuel Kunde"          │2               │
├──────────────────────────┼────────────────┤
│"Waldemar Matysik"        │2               │
├──────────────────────────┼────────────────┤
│"Andrzej Buncol"          │2               │
├──────────────────────────┼────────────────┤
│"Jozef Mlynarczyk"        │2               │
├──────────────────────────┼────────────────┤
│"Wlodimierz Smolarek"     │2               │
├──────────────────────────┼────────────────┤
│"Jacek Kazimierski"       │2               │
├──────────────────────────┼────────────────┤
│"Andrzej Palasz"          │2               │
├──────────────────────────┼────────────────┤
│"Stefan Majewski"         │2               │
├──────────────────────────┼────────────────┤
│"David Narey"             │2               │
├──────────────────────────┼────────────────┤
│"Gordon Strachan"         │2               │
├──────────────────────────┼────────────────┤
│"Steve Archibald"         │2               │
├──────────────────────────┼────────────────┤
│"Willie Miller"           │2               │
├──────────────────────────┼────────────────┤
│"Paul Sturrock"           │2               │
├──────────────────────────┼────────────────┤
│"Andrei Bal"              │2               │
├──────────────────────────┼────────────────┤
│"Sergei Rodionov"         │2               │
├──────────────────────────┼────────────────┤
│"Aleksandre Chivadze"     │2               │
├──────────────────────────┼────────────────┤
│"Oleg Blokhin"            │2               │
├──────────────────────────┼────────────────┤
│"Rafael Gordillo"         │2               │
├──────────────────────────┼────────────────┤
│"Ricardo Gallego"         │2               │
├──────────────────────────┼────────────────┤
│"Antonio Maceda"          │2               │
├──────────────────────────┼────────────────┤
│"Jose Antonio Camacho"    │2               │
├──────────────────────────┼────────────────┤
│"Gerry Armstrong"         │2               │
├──────────────────────────┼────────────────┤
│"Billy Hamilton"          │2               │
├──────────────────────────┼────────────────┤
│"John Mcclelland"         │2               │
├──────────────────────────┼────────────────┤
│"Sam Mcilroy"             │2               │
├──────────────────────────┼────────────────┤
│"David Mccreery"          │2               │
├──────────────────────────┼────────────────┤
│"Norman Whiteside"        │2               │
├──────────────────────────┼────────────────┤
│"Jim Platt"               │2               │
├──────────────────────────┼────────────────┤
│"Pat Jennings"            │2               │
├──────────────────────────┼────────────────┤
│"Mal Donaghy"             │2               │
├──────────────────────────┼────────────────┤
│"Jimmy Nicholl"           │2               │
├──────────────────────────┼────────────────┤
│"John O Neill"            │2               │
├──────────────────────────┼────────────────┤
│"Bruno Conti"             │2               │
├──────────────────────────┼────────────────┤
│"Fulvio Collovati"        │2               │
├──────────────────────────┼────────────────┤
│"Giovanni Galli"          │2               │
├──────────────────────────┼────────────────┤
│"Alessandro Altobelli"    │2               │
├──────────────────────────┼────────────────┤
│"Eike Immel"              │2               │
├──────────────────────────┼────────────────┤
│"Felix Magath"            │2               │
├──────────────────────────┼────────────────┤
│"Karl Heinz Foerster"     │2               │
├──────────────────────────┼────────────────┤
│"Harald Schumacher"       │2               │
├──────────────────────────┼────────────────┤
│"Hans Peter Briegel"      │2               │
├──────────────────────────┼────────────────┤
│"Falcao"                  │2               │
├──────────────────────────┼────────────────┤
│"Socrates"                │2               │
├──────────────────────────┼────────────────┤
│"Junior"                  │2               │
├──────────────────────────┼────────────────┤
│"Jorge Valdano"           │2               │
├──────────────────────────┼────────────────┤
│"Cristobal Ortega"        │2               │
├──────────────────────────┼────────────────┤
│"Kenny Sansom"            │2               │
├──────────────────────────┼────────────────┤
│"Glenn Hoddle"            │2               │
├──────────────────────────┼────────────────┤
│"Ray Wilkins"             │2               │
├──────────────────────────┼────────────────┤
│"Viv Anderson"            │2               │
├──────────────────────────┼────────────────┤
│"Alain Giresse"           │2               │
├──────────────────────────┼────────────────┤
│"Bruno Bellone"           │2               │
├──────────────────────────┼────────────────┤
│"Manuel Amoros"           │2               │
├──────────────────────────┼────────────────┤
│"Jean Tigana"             │2               │
├──────────────────────────┼────────────────┤
│"Bernard Genghini"        │2               │
├──────────────────────────┼────────────────┤
│"Jozsef Csuhay"           │2               │
├──────────────────────────┼────────────────┤
│"Jozsef Varga"            │2               │
├──────────────────────────┼────────────────┤
│"Sandor Sallai"           │2               │
├──────────────────────────┼────────────────┤
│"Imre Garaba"             │2               │
├──────────────────────────┼────────────────┤
│"Raymond Mommens"         │2               │
├──────────────────────────┼────────────────┤
│"Michel Renquin"          │2               │
├──────────────────────────┼────────────────┤
│"Erwin Vandenbergh"       │2               │
├──────────────────────────┼────────────────┤
│"Frank Vercauteren"       │2               │
├──────────────────────────┼────────────────┤
│"Jean Marie Pfaff"        │2               │
├──────────────────────────┼────────────────┤
│"Rene Vandereycken"       │2               │
├──────────────────────────┼────────────────┤
│"Jacques Munaron"         │2               │
├──────────────────────────┼────────────────┤
│"Noureddine Kourichi"     │2               │
├──────────────────────────┼────────────────┤
│"Karim Maroc"             │2               │
├──────────────────────────┼────────────────┤
│"Tedj Bensaoula"          │2               │
├──────────────────────────┼────────────────┤
│"Djamel Zidane"           │2               │
├──────────────────────────┼────────────────┤
│"Faouzi Mansouri"         │2               │
├──────────────────────────┼────────────────┤
│"Mourad Amara"            │2               │
├──────────────────────────┼────────────────┤
│"Lakhdar Belloumi"        │2               │
├──────────────────────────┼────────────────┤
│"Rabah Madjer"            │2               │
├──────────────────────────┼────────────────┤
│"Mahmoud Guendouz"        │2               │
├──────────────────────────┼────────────────┤
│"Salah Assad"             │2               │
├──────────────────────────┼────────────────┤
│"Santillana"              │2               │
├──────────────────────────┼────────────────┤
│"Juanito"                 │2               │
├──────────────────────────┼────────────────┤
│"Luis Arconada"           │2               │
├──────────────────────────┼────────────────┤
│"Quini"                   │2               │
├──────────────────────────┼────────────────┤
│"Vladimir Petrovic"       │2               │
├──────────────────────────┼────────────────┤
│"Ivica Surjak"            │2               │
└──────────────────────────┴────────────────┘
```
